/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/

/**============================================================================
* @File_Name   : main.c
* @Description : 主函数文件
* @Date         : 2015/10/25
* @By           : WindRises（谢玉伸）
* @E_mail      : 1659567673@ qq.com
* @Platform    : MPLAB X IDE v3.10 (pic18f67k22)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 -----------------------------------------------------------------*/
#include <pic18f67k22.h>                //PIC官方函数库
#include "Config_18F167K22.h"           //配置PIC芯片   
#include "My_Delay.h"                   //延时
#include "My_Types.h"                   //自定义的习惯写法定义
#include "Key.h"                        //简写定义
#include "Nixie.h"                     //LED显示 
#include "My_Timer.h"                  
#include "Run.h"
#include "IR2184.h"     

/* 私有宏定义 -----------------------------------------------------------------*/

/* 私有变量声明 ---------------------------------------------------------------*/

/* 全局变量声明 ---------------------------------------------------------------*/

/* 私有（静态）函数声明 --------------------------------------------------------*

/* 全局函数编写 ---------------------------------------------------------------*/

extern unsigned char RS485_Num;
int main(void)
{
    /* 变量定义 --------------------------------*/
   
    /* 初始化 --------------------------------*/
    Key_Init();       //按键     
    Timer0_Init();    //定时器   
    Nixie_Init();     //数码管
    IR2184_Init();    //高速半桥激励器
    Key_Init();
//    GPIO_Config();     //普通输出IO口配置
    
    /* while循环 --------------------------------*/
    while(1) 
    {          
       if(RF2 == 0) RS485_Num++;
//       if(RF3 == 0) RS485_Num--;
       if(RS485_Num > 99 ) RS485_Num = 11;  
       delay_ms(10);
//        Manage_Message();
        Run();  
 
        
    }

return 0;      
}





/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/
