/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/

/**============================================================================
* @File_Name   : GPIO_Config.c
* @Description : None
* @Date         : 2015/10/29
* @By           : WindRises（谢玉伸）
* @E_mail      : 1659567673@ qq.com
* @Platform    : MPLAB X IDE v3.10 (pic18f67k22)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 -----------------------------------------------------------------*/
#include <pic18f67k22.h>
#include "GPIO.h"
#include "My_Types.h"
#include "TM1640.h"

/* 私有宏定义 -----------------------------------------------------------------*/

/* 私有变量定义 ---------------------------------------------------------------*/

/* 私有（静态）函数声明 --------------------------------------------------------*/

/* 全局变量定义 ---------------------------------------------------------------*/
unsigned char LED_BUS = 0x00; 

/* 全局函数编写 ---------------------------------------------------------------*/

/**----------------------------------------------------------------------------
* @Function_Name : GPIO_Config()      
* @Description   : GPIO的配置函数
* @Parameter     : void
* @Return        : void
* @Programer     : WindRises（谢玉伸）
* @Data          : 2015/10/29
* @Explain       : None
------------------------------------------------------------------------------*/
void GPIO_Config()
{
    //主控的LED用TM1640控制
//    TRISE &= 0x1f;//将E 5,6,7配置成输出(写入0用 & )
//  
//    RE5 = 1;
//    RE6 = 1;
//    RE7 = 1;
}

/**----------------------------------------------------------------------------
* @Function_Name : LED_Switch()      
* @Description   : LED控制函数
* @Parameter     : _LED_num:对应的灯序号，_switch：开关（0：关, 1：开）
* @Return        : void
* @Programer     : WindRises（谢玉伸）
* @Data          : 2015/10/29
* @Explain       : None
------------------------------------------------------------------------------*/
void LED_Control(unsigned char _LED_num,unsigned char _switch)
{
    
    
    if(_LED_num == 1)
    if(_switch) LED_BUS |= 0x01;
    else LED_BUS &= 0xFE;    
    
    if(_LED_num == 2)
    if(_switch) LED_BUS |= 0x02;
    else LED_BUS &= 0xFD;    
      
    if(_LED_num == 3)
    if(_switch) LED_BUS |= 0x04;
    else LED_BUS &= 0xFB;    
      
}

/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/


