/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/
/**============================================================================
* @File_Name   : Run.h
* @Description : None
* @Date        : 2015/12/9
* @By          : WindRises（谢玉伸）
* @E_mail      : 1659567673@ qq.com
* @Platform    : MPLAB X IDE v3.10 (pic18f67k22)
* @Explain     : None
*=============================================================================*/

/* 防止重调用 -----------------------------------------------------------------*/
#ifndef __RUN_H
#define __RUN_H 

/* 头文件包含 -----------------------------------------------------------------*/
#include "My_Types.h"

/* 全局宏定义 -----------------------------------------------------------------*/

/* 结构体声明 -----------------------------------------------------------------*/ 
typedef struct  __Switch
{
   unsigned char _1Khz;//1Khz脉冲开关
   unsigned char ADC6;//ADC6采集开关
   unsigned char Usart_OneDate;//发送一组数据
   unsigned char Show_Send_Receive;//显示发送或接收数据 0：接收  1：发送
}__Switch_Def;

/* 全局变量声明 ---------------------------------------------------------------*/ 
extern __Switch_Def Handle_Switch;

/* 全局函数声明 ---------------------------------------------------------------*/  
void Run();
void Manage_Message();
void Show_Result();
#endif
/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/

