/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/
/**============================================================================
* @File_Name   : SCR.h
* @Description : 可控硅驱动程序头文件
* @Date         : 2015/12/19
* @By           : WindRises（谢玉伸）
* @E_mail      : 1659567673@ qq.com
* @Platform    : MPLAB X IDE v3.10 (pic18f67k22)
* @Explain     : None
*=============================================================================*/

/* 防止重调用 -----------------------------------------------------------------*/
#ifndef __SCR_H
#define __SCR_H 

/* 头文件包含 -----------------------------------------------------------------*/
#include "My_Types.h"
#include <pic18f67k22.h>                //PIC官方函数库

/* 全局宏定义 -----------------------------------------------------------------*/
#define _3Khz_Out1_ON()    RB1 = 1       
#define _3Khz_Out1_OFF()   RB1 = 0        

#define _3Khz_Out2_ON()    RB0 = 1      
#define _3Khz_Out2_OFF()   RB0 = 0              

/* 结构体声明 -----------------------------------------------------------------*/ 

/* 枚举类型 -----------------------------------------------------------------*/ 

/* 全局变量声明 ---------------------------------------------------------------*/ 

/* 全局函数声明 ---------------------------------------------------------------*/  
void SCR_Init(void);                     //可控硅初始化
void Delay_1Khz(void);                  //1Khz脉冲延时，误差 -1us
void Pulse_1Khz(unsigned char _QD);     //发出数个1Khz脉冲
void SCR_Demagnet(unsigned char _ch);   //退磁
void SCR_Magnet(unsigned char _ch);     //充磁


#endif
/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/

