/*******************************(C) COPYRIGHT 2016 WindRises（谢玉伸）*********************************/
/**============================================================================
* @File_Name   : IR2184.c
* @Description : None
* @Date         : 2016/2/20
* @By           : WindRises（谢玉伸）
* @E_mail      : 1659567673@ qq.com
* @Platform    : MPLAB X IDE v3.20 (pic18f67k22)
* @Explain     : None
*=============================================================================*/
/* 头文件包含 -----------------------------------------------------------------*/
#include "IR2184.h"               

/* 私有宏定义 -----------------------------------------------------------------*/

/* 私有变量声明 ---------------------------------------------------------------*/

/* 全局变量定义----------------------------------------------------------------*/
unsigned char IR2184_Num = 0;   //用户设定的数值
unsigned int IR2184_Timer = 0;  //打开时计时的时间

/* 私有（静态）函数声明 --------------------------------------------------------*

/* 全局函数编写 ---------------------------------------------------------------*/

/**----------------------------------------------------------------------------
* @Function_Name : IR2184_Init()     
* @Description   : IR2184初始化函数
* @Parameter     : void
* @Return        : void
* @Programer     : WindRises（谢玉伸）
* @Data          : 2016/2/21
* @Explain       : None
------------------------------------------------------------------------------*/
void IR2184_Init(void)
{
    TRISDbits.TRISD2 = 0;  //IN1
    TRISDbits.TRISD3 = 0;  //SD1
    
    TRISEbits.TRISE5 = 0;  //IN2  
    TRISEbits.TRISE6 = 0;  //SD2
    CCP7OD = 0;
    
    TRISFbits.TRISF4 = 1;  //输入1  原理图输入1和输入2标反   
    TRISFbits.TRISF5 = 1;  //输入2      
   
    ANSEL9 = 0;  //配置成数字引脚
    ANSEL10 = 0; 
    
    IR2184_OFF_1();  //默认关闭  
    IR2184_OFF_2();    
    
}
  

/*******************************(C) COPYRIGHT 2016 WindRises（谢玉伸）*********************************/
