/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/

/**============================================================================
* @File_Name   : Key.h
* @Description : None
* @Date        : 2015/10/25
* @By          : WindRises（谢玉伸）
* @E_mail      : 1659567673@ qq.com
* @Platform    : MPLAB X IDE v3.10 (pic18f67k22)
* @Explain     : None
*=============================================================================*/
/* 防止重调用 -----------------------------------------------------------------*/
#ifndef __KEY_H
#define __KEY_H 
/* 头文件包含 -----------------------------------------------------------------*/
#include "My_Types.h"

/* 全局宏定义 -----------------------------------------------------------------*/
/*=-=-=-=-=-=-=-=-=-=-=-=- 按键状态 =-=-=-=-=-=-=-=-=-=-=-*/
#define KEY_default 0x00   //无状态
#define KEY_short   0x01   //短按
#define KEY_double  0x02   //连按
#define KEY_hold    0x03   //长按

/*=-=-=-=-=-=-=-=-=-=-=-=- 组合按键 =-=-=-=-=-=-=-=-=-=-=-*/
#define KEY_1_2     (0xff)     //key1和2组合
#define KEY_1_3     (0xff-1)   //key1和3组合
#define KEY_1_4     (0xff-2)   //key1和4组合
#define KEY_2_3     (0xff-3)   //key2和3组合
#define KEY_2_4     (0xff-4)   //key2和4组合
#define KEY_3_4     (0xff-5)   //key3和4组合

/* 结构体声明 -----------------------------------------------------------------*/ 
/*=-=-=-=-=-=-=-=-=-=-=-=- 按键状态机 =-=-=-=-=-=-=-=-=-=-=-*/
typedef struct KEY_FSM__ 
{
 volatile uchar key_state ; //目前按键状态
 volatile uchar key_last ;  //上一次按键状态
 volatile uchar key_count ; //按键计数
}key_FSM__; 

/* 全局变量声明 ---------------------------------------------------------------*/ 
extern key_FSM__ Local_Key;

/* 全局函数声明 ---------------------------------------------------------------*/  
void Key_Scan();
void Key_Init();




#endif
/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/
