/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/

/**============================================================================
* @File_Name   : Relay.c
* @Description : None
* @Date         : 2015/12/18
* @By           : WindRises（谢玉伸）
* @E_mail      : 1659567673@ qq.com
* @Platform    : MPLAB X IDE v3.10 (pic18f67k22)
* @Explain     : 工程的主要运行源文件
*=============================================================================*/

/* 头文件包含 -----------------------------------------------------------------*/                  
#include <pic18f67k22.h>                //PIC官方函数库
#include "My_Types.h"                   //自定义的习惯写法定义
#include "Relay.h"                      //继电器
#include "My_Delay.h"                   //延时

/* 私有宏定义 -----------------------------------------------------------------*/
#define RELAY_DELAY_TIME 4

/* 私有变量定义 ---------------------------------------------------------------*/

/* 私有（静态）函数声明 --------------------------------------------------------*/

/* 全局变量定义 ---------------------------------------------------------------*/
  
/* 全局函数编写 ---------------------------------------------------------------*/

/**----------------------------------------------------------------------------
* @Function_Name : Relay_Init()     
* @Description   : 继电器初始化
* @Parameter     : void
* @Return        : void
* @Programer     : WindRises（谢玉伸）
* @Data          : 2015/12/18
* @Explain       : None
------------------------------------------------------------------------------*/
void Relay_Init(void)
{
    /*配置继电器的IO口 -----------------------*/
    TRISD0 = 0;  //TON1   
    TRISD1 = 0;  //TOFF1
    TRISD2 = 0;  //TON2
    TRISD3 = 0;  //TOFF2
    TRISD4 = 0;  //TON3
    TRISD7 = 0;  //TOFF3      
}


/**----------------------------------------------------------------------------
* @Function_Name : Relay_Control()     
* @Description   : 继电器初始化
* @Parameter     : void
* @Return        : void
* @Programer     : WindRises（谢玉伸）
* @Data          : 2015/12/19
* @Explain       : None
------------------------------------------------------------------------------*/
void Relay_Control(unsigned char relay_num,unsigned char _switch)
{
    /* 继电器1 -----------------------*/
    if( relay_num == 1)    
    {
        if(_switch)
        {
            RD0 = 1,RD1 = 0;
        }
        else
        {
           RD0 = 0,RD1 = 1;    
        }
    }
    
    /* 继电器2 -----------------------*/
     if( relay_num == 2)    
    {
        if(_switch)
        {
            RD2 = 1,RD3 = 0;  
        }
        else
        {
           RD2 = 0,RD3 = 1;     
        }
    }
    
    /* 继电器3 -----------------------*/
     if( relay_num == 3)    
    {
        if(_switch)
        {
            RD4 = 1,RD7 = 0;
        }
        else
        {
           RD4 = 0,RD7 = 1;      
        }
    }
    
    /* 继电器设置完毕后延时 ------------*/
    if( relay_num >= 1 && relay_num <=3 )
    {
        delay_ms(RELAY_DELAY_TIME);  
    }
    
    /* 将继电器失能 -------------------*/
    RD0 = 0;
    RD1 = 0;
    RD2 = 0;
    RD3 = 0;
    RD4 = 0;
    RD7 = 0;
    
}





/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/

