/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/
/**============================================================================
* @File_Name   : Nixie.h
* @Description : None
* @Date         : 2016/2/20
* @By           : WindRises（谢玉伸）
* @E_mail      : 1659567673@ qq.com
* @Platform    : MPLAB X IDE v3.10 (pic18f67k22)
* @Explain     : None
*=============================================================================*/

#ifndef NIXIE_H
#define	NIXIE_H

/* 头文件包含 -----------------------------------------------------------------*/
#include <pic18f67k22.h>

/* 私有宏定义 -----------------------------------------------------------------*/
#define NIX_S1()  RA5 = 1 , RA4 = 0          
#define NIX_S2()  RA4 = 1 , RA5 = 0 
#define NIX_OFF()  RA4 = 0 , RA5 = 0 

#define DP  0x10   //点

/* 私有变量定义 ---------------------------------------------------------------*/

/* 私有（静态）函数声明 --------------------------------------------------------*/

/* 全局变量定义 ---------------------------------------------------------------*/

/* 全局函数定义 ---------------------------------------------------------------*/
void Nixie_ShowBit(unsigned char _bit,unsigned char _num);
void Nixie_ShowNum(unsigned char _num);
void Nixie_Init(void);


#endif

