/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/

/**============================================================================
* @File_Name   : main.c
* @Description : 主函数文件
* @Date         : 2015/10/25
* @By           : WindRises（谢玉伸）
* @E_mail      : 1659567673@ qq.com
* @Platform    : MPLAB X IDE v3.10 (pic18f67k22)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 -----------------------------------------------------------------*/
#include <pic18f67k22.h>                //PIC官方函数库
#include "Config_18F167K22.h"           //配置PIC芯片   
#include "My_Delay.h"                   //延时
#include "GPIO_Config.h"                //GPIO口的配置
#include "My_Types.h"                   //简写定义

/* 私有宏定义 -----------------------------------------------------------------*/

/* 私有变量声明 ---------------------------------------------------------------*/

/* 私有（静态）函数声明 --------------------------------------------------------*/

/* 全局函数编写 ---------------------------------------------------------------*/


int main(void)
{
    GPIO_Config();    //LED灯
    Key_Init();       //按键
    
    while (1)
    {
        if(PORTCbits.RC2 == 0) LED1_ON else LED1_OFF  
        if(PORTCbits.RC3 == 0) LED2_ON else LED2_OFF          
        if(PORTCbits.RC4 == 0) LED3_ON else LED3_OFF  
        if(PORTCbits.RC5 == 0) LED4_ON else LED4_OFF  
    }
    
    return 0;
}





/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/
