/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/
/**============================================================================
* @File_Name   : Menu.h
* @Description : None
* @Date        : 2015/12/24
* @By          : WindRises（谢玉伸）
* @E_mail      : 1659567673@ qq.com
* @Platform    : MPLAB X IDE v3.10 (pic18f67k22)
* @Explain     : 菜单文件
*=============================================================================*/

/* 防止重调用 -----------------------------------------------------------------*/
#ifndef __MzH
#define __MENU_H 

/* 头文件包含 -----------------------------------------------------------------*/
#include "My_Types.h"
#include <pic18f67k22.h>                //PIC官方函数库
                             
/* 全局宏定义 -----------------------------------------------------------------*/
                                                    
/* 结构体声明 -----------------------------------------------------------------*/ 
typedef struct Struct_Menu
{   
   uchar Channel[8];  //通道          
   char Mune[5];     //n级菜单选项                 
   uchar Lock;       //锁定          
   uchar select;            
   uchar Level;             
   uchar Switch;            
   uchar Num;
   
}Menu_Def;

/* 枚举类型 -------------------------------------------------------------------*/ 
/* 1级菜单 --------------------------------------------*/
enum __Mune1
{
    Mune1_P = 0,  //设置界面
    Mune1_F,      //查看界面
                                         
};  

/* 2级菜单 --------------------------------------------*/
enum __Mune_2
{
    /* 设置菜单内 -----------------*/    
    Mune2_Switch = 0,  //开关通道选择
    Mune2_Magnet,      //充磁通道选择
    Mune2_Demagnet,    //退磁通道选择 
                                      
    /* 查看菜单内 ----------------*/      
                                     
};

/* 各种界面 --------------------------------------------*/
enum __UI
{
    UI_Lock = 0,       //锁定
    UI_Unlock,         //解锁
    UI_Magnet,         //充磁
    UI_Demagnet,       //退磁
    UI_P,              //P显示
    UI_F,              //F显示
    UI_E,              //E显示      
                                            
};                   

/* 全局变量声明 ---------------------------------------------------------------*/ 
extern Menu_Def gs_Menu; //目录菜单            

/* 全局函数声明 ---------------------------------------------------------------*/  
void Menu_Init(void);                                                                    

#endif
/*******************************(C) COPYRIGHT 2015 WindRises（谢玉伸）*********************************/

